package org.surkov.hranalyzer.giga_chat.enumiration;

/**
 * Модели для генерации.
 */
public enum GigaModelType {
    /**
     * Легкая модель для простых задач, требующих максимальной скорости работы.
     */
    GIGA_MODEL_LITE,
    /**
     * Продвинутая модель для сложных задач, требующих креативности и лучшего следования инструкциям.
     */
    GIGA_MODEL_PRO,
    /**
     * Продвинутая модель для сложных задач, требующих высокого уровня креативности и качества работы.
     */
    GIGA_MODEL_MAX
}
